Revit 2026 API

# DocumentParameterBindings Property

---

Retrieves an object from which mappings between parameter definitions and categories can be found.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public BindingMap ParameterBindings { get; }
```
```vb
Public ReadOnly Property ParameterBindings As BindingMap
	Get
```
```cpp
public:
property BindingMap^ ParameterBindings {
	BindingMap^ get ();
}
```
```fsharp
member ParameterBindings : BindingMap with get
```

#### Property Value

BindingMap

| Exception | Condition |
| --- | --- |
| InvalidOperationException | When the document is a family document. |

Returns a mapping between parameter definitions and parameter bindings. New bindings can be added to the Revit Document by using this object.

#### Reference

Document Class

Autodesk.Revit.DB Namespace